api/app/controllers/category_entities_controller.rb

  def index
    @category_entities = CategoryEntity.all
---
SELECT `category_entities`.* FROM `category_entities`

  def show
    @category_entity = CategoryEntity.find(params[:id])
---
SELECT `category_entities`.* FROM `category_entities` WHERE `category_entities`.`id` = 1 LIMIT 1

  def create
    @category_entity = CategoryEntity.new(params[:category_entity])

    if @category_entity.save
---
INSERT INTO `category_entities` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2012-09-22 11:00:18', NULL, NULL, '2012-09-22 11:00:18')