api/app/controllers/entities_controller.rb

  def index
    @entities = Entity.all
---
SELECT `entities`.* FROM `entities`